package day5;
//문제)배열을 사용하여 학생수많큼 점수를 입력받고
//    분석(최고득점,평균) 할수있다.
//    ------------------------------------------------------
//    1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
//    ------------------------------------------------------
//    선택>>
//
//    1번선택시 학생수입력
//    학생수> 4
//
//    2번선택시 점수를 키보드로 학생수 많큼 입력받는다
//    점수1> 90
//    점수2> 70
//    점수3> 60
//    점수4> 80
//
//    3번 선택시 입력된 점수 목록을 보여준다
//    score[0] = 90
//    score[1] = 70
//    score[2] = 60
//    score[3] = 80
//
//    4번 선택시
//    최고점수 = 90
//    평균 = 75
//
//    5번 선택시 아래 메세지 출력후 종료함
//    프로그램 종료!!

public class Problem2 {
  public static void main(String[] args) {

  }
}
